In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import OneHotEncoder,LabelEncoder

In [4]:
data = pd.read_csv('loan_approval_dataset.csv')

In [5]:
data.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [6]:
data['education'].unique()

array([' Graduate', ' Not Graduate'], dtype=object)

In [8]:
df = data.copy()

In [10]:
for col in df.columns:
    if df[col].dtype=='O':
        df[col] = df[col].str.strip()

In [11]:
df['education'].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [12]:
df.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [13]:
numerical = []
categorical = []

for col in df.columns:
    if df[col].dtype=='O':
        categorical.append(col)
    else:
        numerical.append(col)

In [15]:
df_cat = df[categorical].copy()

In [16]:
df_cat

         education self_employed loan_status
0         Graduate            No    Approved
1     Not Graduate           Yes    Rejected
2         Graduate            No    Rejected
3         Graduate            No    Rejected
4     Not Graduate           Yes    Rejected
...            ...           ...         ...
4264      Graduate           Yes    Rejected
4265  Not Graduate           Yes    Approved
4266  Not Graduate            No    Rejected
4267  Not Graduate            No    Approved
4268      Graduate            No    Approved

[4269 rows x 3 columns]

In [20]:
ohe = OneHotEncoder(drop='first')
transformed_df = ohe.fit_transform(df_cat)

In [21]:
transformed_df

<4269x3 sparse matrix of type '<class 'numpy.float64'>'
	with 5888 stored elements in Compressed Sparse Row format>

In [22]:
transformed_df.toarray()

array([[0., 0., 0.],
       [1., 1., 1.],
       [0., 0., 1.],
       ...,
       [1., 0., 1.],
       [1., 0., 0.],
       [0., 0., 0.]])

In [23]:
ohe.get_feature_names_out()

array(['education_Not Graduate', 'self_employed_Yes',
       'loan_status_Rejected'], dtype=object)

In [24]:
pd.DataFrame(data=transformed_df.toarray(),columns=ohe.get_feature_names_out()).head()

   education_Not Graduate  self_employed_Yes  loan_status_Rejected
0                     0.0                0.0                   0.0
1                     1.0                1.0                   1.0
2                     0.0                0.0                   1.0
3                     0.0                0.0                   1.0
4                     1.0                1.0                   1.0